#+setupfile: info/index-bigblow-header.setup
#+include: info/common-header.org
#+AUTHOR: 鈴木正幸，非常勤講師
#+OPTIONS:
#+property: header-arg:R :session t :results output :exports both


** 指導法データの準備

#+begin_src R :session t :results output :exports both :tangle babel/r-05-03.r

指導法データ <- read.csv("data/shidouhouU8.csv")

#+end_src

#+RESULTS:
:  file(file, "rt") でエラー:  コネクションを開くことができません 
:  追加情報:  警告メッセージ: 
:  file(file, "rt") で: 
:    ファイル 'data/shidouhouU8.csv' を開くことができません: そのようなファイルやディレクトリはありません

*** 指導法 (A, B, C, D)ごとの統計テスト2の得点表の作成
     
#+begin_src R :session t :results output :exports both

As <- subset(指導法データ, method=="A")$stat_test2
Bs <- subset(指導法データ, method=="B")$stat_test2
Cs <- subset(指導法データ, method=="C")$stat_test2
Ds <- subset(指導法データ, method=="D")$stat_test2
table.71 <- data.frame(A=As, B=Bs, C=Cs, D=Ds)
全データ <- cbind(As, Bs, Cs, Ds)

#+end_src

#+RESULTS:
#+begin_example
 subset(指導法データ, method == "A") でエラー: 
   オブジェクト '指導法データ' がありません
 subset(指導法データ, method == "B") でエラー: 
   オブジェクト '指導法データ' がありません
 subset(指導法データ, method == "C") でエラー: 
   オブジェクト '指導法データ' がありません
 subset(指導法データ, method == "D") でエラー: 
   オブジェクト '指導法データ' がありません
 data.frame(A = As, B = Bs, C = Cs, D = Ds) でエラー: 
   オブジェクト 'As' がありません
 cbind(As, Bs, Cs, Ds) でエラー:  オブジェクト 'As' がありません
#+end_example

*** 平均

#+begin_src R :session t :results output :exports both

(全平均 <- mean(全データ))
(群平均 <- colMeans(全データ))
(群平均行列 <- matrix(rep(群平均, 5), nrow=5, ncol=4, byrow=TRUE))

#+end_src

#+RESULTS:
: [1] 10
:   As   Bs   Cs   Ds 
: 14.8  9.6  9.2  6.4
:      [,1] [,2] [,3] [,4]
: [1,] 14.8  9.6  9.2  6.4
: [2,] 14.8  9.6  9.2  6.4
: [3,] 14.8  9.6  9.2  6.4
: [4,] 14.8  9.6  9.2  6.4
: [5,] 14.8  9.6  9.2  6.4

*** 差

#+begin_src R :session t :results output :exports both

(全体差 <- 全データ - 全平均) # 行列 - スカラ
(群間差 <- 群平均行列 - 全平均)
(群内差 <- 全データ - 群平均行列)

#+end_src

#+RESULTS:
#+begin_example
     As Bs Cs Ds
[1,]  5  3  0  0
[2,] -1 -2 -4 -3
[3,]  8 -2  1 -7
[4,]  4  2 -3 -5
[5,]  8 -3  2 -3
     [,1] [,2] [,3] [,4]
[1,]  4.8 -0.4 -0.8 -3.6
[2,]  4.8 -0.4 -0.8 -3.6
[3,]  4.8 -0.4 -0.8 -3.6
[4,]  4.8 -0.4 -0.8 -3.6
[5,]  4.8 -0.4 -0.8 -3.6
       As   Bs   Cs   Ds
[1,]  0.2  3.4  0.8  3.6
[2,] -5.8 -1.6 -3.2  0.6
[3,]  3.2 -1.6  1.8 -3.4
[4,] -0.8  2.4 -2.2 -1.4
[5,]  3.2 -2.6  2.8  0.6
#+end_example

*** 平方和と自由度とF-値
      
#+begin_src R :session t :results output :exports both

群間平方和 <- sum(群間差^2)
群内平方和 <- sum(群内差^2)
全体平方和 <- 群間平方和 + 群内平方和

(群間自由度 <- ncol(全データ)-1)
(群内自由度 <- (nrow(全データ)-1) * ncol(全データ))
(全体自由度 <- length(全データ)-1 )

全体自由度 - 群間自由度 - 群内自由度

(群間平均平方 <- 群間平方和/群間自由度)
(群内平均平方 <- 群内平方和/群内自由度)
(全体平均平方 <- 全体平方和/全体自由度)

(F <- 群間平均平方 / 群内平均平方)

#+end_src

#+RESULTS:
: [1] 3
: [1] 16
: [1] 19
: [1] 0
: [1] 61.33333
: [1] 8.625
: [1] 16.94737
: [1] 7.111111

#+begin_src R :session t :results output :exports both
(群平均行列 <- matrix(rep(群平均, 5), nrow=5, ncol=4, byrow=TRUE))

#+end_src


***** 7.2-データ準備
      
 #+NAME: table-7.3
  | 学生 | 線形代数 | 微分積分 | 確率統計 |
  |------+----------+----------+----------|
  | 田中 |        7 |        5 |        8 |
  | 岸   |        8 |        4 |        6 |
  | 大引 |        9 |        7 |        7 |
  | 吉川 |        5 |        1 |        2 |
  | 荻野 |        6 |        3 |        5 |

 #+begin_src R :session t :results output :exports both :var table=table-7.3 :file graphs/table-7.3.png

(Table73 <- table)
(好感度s  <- c(Table73$線形代数, Table73$微分積分, Table73$確率統計))
科目名s <- names(Table73)
(科目s <- c(rep(科目名s[2], 5), rep(科目名s[3], 5), rep(科目名s[4], 5)))
(人s <- rep(Table73[,1], 3))


 #+end_src
